miro-kostadinov/tmos/tmos/hardware/lm3s/usb_lm3s.h
/**************************************************************************//**
 * @ingroup	 hardware_lm3s
 * @defgroup lm3s_usb_api USB
 * @{
 * @file     hardware/lm3s/usb_lm3s.h
 * @brief    LM3S USB Header File
 * @version  V3.00
 * @date     30. May 2011
 * @author	 Miroslav Kostadinov
 *
 *
 ******************************************************************************/

#ifndef USB_LM3S_H_
#define USB_LM3S_H_


//==============================================================================
// C/C++ definitions
//==============================================================================
#ifndef __ASSEMBLY__
#ifdef __cplusplus
 extern "C" {
#endif

#include <tmos_types.h>

// Internal struct for USB host device to endpoint mapping
typedef struct
{
    __IO uint8_t  USBTXFUNCADDR;	//!< (off 0x0) USB Transmit Functional Address Endpoint 0-15
         uint8_t  reserved1;
    __IO uint8_t  USBTXHUBADDR;	   	//!< (off 0x2) USB Transmit Hub Address Endpoint 0-15
    __IO uint8_t  USBTXHUBPORT;	   	//!< (off 0x3) USB Transmit Hub Port Endpoint 0-15
    __IO uint8_t  USBRXFUNCADDR;	//!< (off 0x4) USB Receive Functional Address Endpoint 1-15
         uint8_t  reserved2;
    __IO uint8_t  USBRXHUBADDR;	   	//!< (off 0x6) USB Receive Hub Address Endpoint 1-15
    __IO uint8_t  USBRXHUBPORT;	   	//!< (off 0x7) USB Receive Hub Port Endpoint 1-15
} USBHOSTFUNS_t;

// Internal struct for USB device endpoint mapping
typedef struct
{
/*
 * 	NOTE: For unknown reason the datasheet is using different names for endpoint 0
 *	Since the functionality is the same and to make all endpoints to look like
 *	array we use
 *
 *
         uint8_t  reserved1[2];
	__O  uint8_t  USBCSRL0;     	//!< (off 0x2) USB Control and Status Endpoint 0 Low
	__O  uint8_t  USBCSRH0;         //!< (off 0x3) USB Control and Status Endpoint 0 High
		 uint8_t  reserved2[4];
	__I  uint8_t  USBCOUNT0;        //!< (off 0x8) USB Receive Byte Count Endpoint 0
 		 uint8_t  reserved3[1];
	__IO uint8_t  USBTYPE0;         //!< (off 0xA) USB Type Endpoint 0
	__IO uint8_t  USBNAKLMT;        //!< (off 0xB) USB NAK Limit
		 uint8_t  reserved4[4];
*/
	__IO uint16_t USBTXMAXP;  		//!< (off 0x0) USB Maximum Transmit Data Endpoint 1-15
	__IO uint8_t  USBTXCSRL;	   	//!< (off 0x2) USB Transmit Control and Status Endpoint 0-15 Low
	__IO uint8_t  USBTXCSRH;    	//!< (off 0x3) USB Transmit Control and Status Endpoint 0-15 High
	__IO uint16_t USBRXMAXP;		//!< (off 0x4) USB Maximum Receive Data Endpoint 1-15
	__IO uint8_t  USBRXCSRL;     	//!< (off 0x6) USB Receive Control and Status Endpoint 1-15 Low
	__IO uint8_t  USBRXCSRH;		//!< (off 0x7) USB Receive Control and Status Endpoint 1-15 High
	__I  uint16_t USBRXCOUNT;		//!< (off 0x8) USB Receive Byte Count Endpoint 0-15
	__IO uint8_t  USBTXTYPE;		//!< (off 0xA) USB Host Transmit Configure Type Endpoint 0-15
	__IO uint8_t  USBTXINTERVAL;	//!< (off 0xB) USB Host Transmit Interval Endpoint 0-15
	__IO uint8_t  USBRXTYPE;		//!< (off 0xC) USB Host Configure Receive Type Endpoint 1-15
	__IO uint8_t  USBRXINTERVAL;	//!< (off 0xD) USB Host Receive Polling Interval Endpoint 1-15
		uint8_t   reserved[2];

} USBDEVICEEP_t;

// Internal struct for USB request packet counters
typedef struct
{
/*
 * 	NOTE: Endpoint 0 has no counter
 *
*/
    __IO uint16_t USBRQPKTCOUNT;   	//!< (off 0x0) USB Request Packet Count in Block Transfer Endpoint 1-15
         uint8_t  reserved[2];

} USBRPCNT_t;

//=============================================================================
//			       Universal Serial Bus Controller (USB)
//=============================================================================
typedef struct
{
    __IO uint8_t  USBFADDR;			//!< (off 0x000) USB Device Functional Address
    __IO uint8_t  USBPOWER;			//!< (off 0x001) USB Power
    __I  uint16_t USBTXIS;			//!< (off 0x002) USB Transmit Interrupt Status
    __I  uint16_t USBRXIS;			//!< (off 0x004) USB Receive Interrupt Status
    __IO uint16_t USBTXIE;			//!< (off 0x006) USB Transmit Interrupt Enable
    __IO uint16_t USBRXIE;			//!< (off 0x008) USB Receive Interrupt Enable
    __I  uint8_t  USBIS;			//!< (off 0x00A) USB General Interrupt Status
    __IO uint8_t  USBIE;			//!< (off 0x00B) USB Interrupt Enable
    __I  uint16_t USBFRAME;			//!< (off 0x00C) USB Frame Value
    __IO uint8_t  USBEPIDX;			//!< (off 0x00E) USB Endpoint Index
    __IO uint8_t  USBTEST;			//!< (off 0x00F) USB Test Mode
         uint8_t  reserved1[16];
    __IO uint32_t USBFIFO[16];		//!< (off 0x020) USB FIFO Endpoint 0-15
    __IO uint8_t  USBDEVCTL;		//!< (off 0x060) USB Device Control
         uint8_t  reserved2;
    __IO uint8_t  USBTXFIFOSZ;		//!< (off 0x062) USB Transmit Dynamic FIFO Sizing
    __IO uint8_t  USBRXFIFOSZ;		//!< (off 0x063) USB Receive Dynamic FIFO Sizing
    __IO uint16_t USBTXFIFOADD; 	//!< (off 0x064) USB Transmit FIFO Start Address
    __IO uint16_t USBRXFIFOADD; 	//!< (off 0x066) USB Receive FIFO Start Address
         uint8_t  reserved3[18];
    __IO uint8_t  USBCONTIM;		//!< (off 0x07A) USB Connect Timing
    __IO uint8_t  USBVPLEN;			//!< (off 0x07B) USB OTG VBus Pulse Timing
         uint8_t  reserved4;
    __IO uint8_t  USBFSEOF;			//!< (off 0x07D) USB Full-Speed Last Transaction to End of Frame Timing
    __IO uint8_t  USBLSEOF;			//!< (off 0x07E) USB Low-Speed Last Transaction to End of Frame Timing
         uint8_t  reserved5;
    USBHOSTFUNS_t HOST_EP[16];		//!< (0ff 0x080) USB Host endpoints mapping
    USBDEVICEEP_t DEVICE_EP[16];	//!< (0ff 0x100) USB Device endpoints mapping
         uint8_t  reserved6[256];
    USBRPCNT_t	  HOST_PC[16];		//!< (0ff 0x300) USB Request Packet Count in Block Transfer
    __IO uint16_t USBRXDPKTBUFDIS;  //!< (off 0x340) USB Receive Double Packet Buffer Disable
    __IO uint16_t USBTXDPKTBUFDIS;  //!< (off 0x342) USB Transmit Double Packet Buffer Disable
         uint8_t  reserved7[188];
    __IO uint32_t USBEPC;			//!< (off 0x400) USB External Power Control
    __I  uint32_t USBEPCRIS;		//!< (off 0x404) USB External Power Control Raw Interrupt Status
    __IO uint32_t USBEPCIM;			//!< (off 0x408) USB External Power Control Interrupt Mask
    __IO uint32_t USBEPCISC; 		//!< (off 0x40C) USB External Power Control Interrupt Status and Clear
    __I  uint32_t USBDRRIS; 		//!< (off 0x410) USB Device RESUME Raw Interrupt Status
    __IO uint32_t USBDRIM; 			//!< (off 0x414) USB Device RESUME Interrupt Mask
    __O  uint32_t USBDRISC; 		//!< (off 0x418) USB Device RESUME Interrupt Status and Clear
    __IO uint32_t USBGPCS; 			//!< (off 0x41C) USB General-Purpose Control and Status
    	 uint32_t reserved8[4];
    __IO uint32_t USBVDC; 			//!< (off 0x430) USB VBUS Droop Control
    __I  uint32_t USBVDCRIS; 		//!< (off 0x434) USB VBUS Droop Control Raw Interrupt Status
    __IO uint32_t USBVDCIM; 		//!< (off 0x438) USB VBUS Droop Control Interrupt Mask
    __IO uint32_t USBVDCISC; 		//!< (off 0x43C) USB VBUS Droop Control Interrupt Status and Clear
    	 uint32_t reserved9;
    __I  uint32_t USBIDVRIS; 		//!< (off 0x444) USB ID Valid Detect Raw Interrupt Status
    __IO uint32_t USBIDVIM; 		//!< (off 0x448) USB ID Valid Detect Interrupt Mask
    __IO uint32_t USBIDVISC; 		//!< (off 0x44C) USB ID Valid Detect Interrupt Status and Clear
    __IO uint32_t USBDMASEL; 		//!< (off 0x450) USB DMA Select
} USB_Type;


#ifdef __cplusplus
}
#endif
#endif /* __ASSEMBLY__ */


//==============================================================================
//				USB registers
//==============================================================================


//-- USB off 0x000 USBFADDR: 		Device Functional Address  -
#define USB_USBFADDR_FUNCADDR_Msk	0x0000007F  //!< Function Address of Device as received through SET_ADDRESS

