miro-kostadinov/tmos/tmos/hardware/lm3s/usb_lm3s.h
//-- USB off 0x001 USBPOWER:		Power
#define USB_USBPOWER_ISOUP         0x00000080  //!< Isochronous Update (device mode)
#define USB_USBPOWER_SOFTCONN      0x00000040  //!< Soft Connect/Disconnect (device mode)
#define USB_USBPOWER_RESET         0x00000008  //!< RESET Signaling
#define USB_USBPOWER_RESUME        0x00000004  //!< Resume Signaling
#define USB_USBPOWER_SUSPEND       0x00000002  //!< SUSPEND Mode
#define USB_USBPOWER_PWRDNPHY      0x00000001  //!< Power Down PHY

//-- USB off 0x002 USBTXIS:			Transmit Interrupt Status
#define USB_USBTXIS_EP15           0x00008000  //!< TX Endpoint 15 Interrupt
#define USB_USBTXIS_EP14           0x00004000  //!< TX Endpoint 14 Interrupt
#define USB_USBTXIS_EP13           0x00002000  //!< TX Endpoint 13 Interrupt
#define USB_USBTXIS_EP12           0x00001000  //!< TX Endpoint 12 Interrupt
#define USB_USBTXIS_EP11           0x00000800  //!< TX Endpoint 11 Interrupt
#define USB_USBTXIS_EP10           0x00000400  //!< TX Endpoint 10 Interrupt
#define USB_USBTXIS_EP9            0x00000200  //!< TX Endpoint 9 Interrupt
#define USB_USBTXIS_EP8            0x00000100  //!< TX Endpoint 8 Interrupt
#define USB_USBTXIS_EP7            0x00000080  //!< TX Endpoint 7 Interrupt
#define USB_USBTXIS_EP6            0x00000040  //!< TX Endpoint 6 Interrupt
#define USB_USBTXIS_EP5            0x00000020  //!< TX Endpoint 5 Interrupt
#define USB_USBTXIS_EP4            0x00000010  //!< TX Endpoint 4 Interrupt
#define USB_USBTXIS_EP3            0x00000008  //!< TX Endpoint 3 Interrupt
#define USB_USBTXIS_EP2            0x00000004  //!< TX Endpoint 2 Interrupt
#define USB_USBTXIS_EP1            0x00000002  //!< TX Endpoint 1 Interrupt
#define USB_USBTXIS_EP0            0x00000001  //!< TX and RX Endpoint 0 Interrupt

//-- USB off 0x004 USBRXIS:			Receive Interrupt Status
#define USB_USBRXIS_EP15           0x00008000  //!< RX Endpoint 15 Interrupt
#define USB_USBRXIS_EP14           0x00004000  //!< RX Endpoint 14 Interrupt
#define USB_USBRXIS_EP13           0x00002000  //!< RX Endpoint 13 Interrupt
#define USB_USBRXIS_EP12           0x00001000  //!< RX Endpoint 12 Interrupt
#define USB_USBRXIS_EP11           0x00000800  //!< RX Endpoint 11 Interrupt
#define USB_USBRXIS_EP10           0x00000400  //!< RX Endpoint 10 Interrupt
#define USB_USBRXIS_EP9            0x00000200  //!< RX Endpoint 9 Interrupt
#define USB_USBRXIS_EP8            0x00000100  //!< RX Endpoint 8 Interrupt
#define USB_USBRXIS_EP7            0x00000080  //!< RX Endpoint 7 Interrupt
#define USB_USBRXIS_EP6            0x00000040  //!< RX Endpoint 6 Interrupt
#define USB_USBRXIS_EP5            0x00000020  //!< RX Endpoint 5 Interrupt
#define USB_USBRXIS_EP4            0x00000010  //!< RX Endpoint 4 Interrupt
#define USB_USBRXIS_EP3            0x00000008  //!< RX Endpoint 3 Interrupt
#define USB_USBRXIS_EP2            0x00000004  //!< RX Endpoint 2 Interrupt
#define USB_USBRXIS_EP1            0x00000002  //!< RX Endpoint 1 Interrupt

//-- USB off 0x006 USBTXIE:			Transmit Interrupt Enable
#define USB_USBTXIE_EP15           0x00008000  //!< TX Endpoint 15 Interrupt Enable
#define USB_USBTXIE_EP14           0x00004000  //!< TX Endpoint 14 Interrupt Enable
#define USB_USBTXIE_EP13           0x00002000  //!< TX Endpoint 13 Interrupt Enable
#define USB_USBTXIE_EP12           0x00001000  //!< TX Endpoint 12 Interrupt Enable
#define USB_USBTXIE_EP11           0x00000800  //!< TX Endpoint 11 Interrupt Enable
#define USB_USBTXIE_EP10           0x00000400  //!< TX Endpoint 10 Interrupt Enable
#define USB_USBTXIE_EP9            0x00000200  //!< TX Endpoint 9 Interrupt Enable
#define USB_USBTXIE_EP8            0x00000100  //!< TX Endpoint 8 Interrupt Enable
#define USB_USBTXIE_EP7            0x00000080  //!< TX Endpoint 7 Interrupt Enable
#define USB_USBTXIE_EP6            0x00000040  //!< TX Endpoint 6 Interrupt Enable
#define USB_USBTXIE_EP5            0x00000020  //!< TX Endpoint 5 Interrupt Enable
#define USB_USBTXIE_EP4            0x00000010  //!< TX Endpoint 4 Interrupt Enable
#define USB_USBTXIE_EP3            0x00000008  //!< TX Endpoint 3 Interrupt Enable
#define USB_USBTXIE_EP2            0x00000004  //!< TX Endpoint 2 Interrupt Enable
#define USB_USBTXIE_EP1            0x00000002  //!< TX Endpoint 1 Interrupt Enable
#define USB_USBTXIE_EP0            0x00000001  //!< TX and RX Endpoint 0 Interrupt Enable
#define USB_USBTXIE_ALL            0x0000FFFF  //!< TX and RX Endpoint 0 Interrupt Enable

//-- USB off 0x008 USBRXIE:			Receive Interrupt Enable
#define USB_USBRXIE_EP15           0x00008000  //!< RX Endpoint 15 Interrupt Enable
#define USB_USBRXIE_EP14           0x00004000  //!< RX Endpoint 14 Interrupt Enable
#define USB_USBRXIE_EP13           0x00002000  //!< RX Endpoint 13 Interrupt Enable
#define USB_USBRXIE_EP12           0x00001000  //!< RX Endpoint 12 Interrupt Enable
#define USB_USBRXIE_EP11           0x00000800  //!< RX Endpoint 11 Interrupt Enable
#define USB_USBRXIE_EP10           0x00000400  //!< RX Endpoint 10 Interrupt Enable
#define USB_USBRXIE_EP9            0x00000200  //!< RX Endpoint 9 Interrupt Enable
#define USB_USBRXIE_EP8            0x00000100  //!< RX Endpoint 8 Interrupt Enable
#define USB_USBRXIE_EP7            0x00000080  //!< RX Endpoint 7 Interrupt Enable
#define USB_USBRXIE_EP6            0x00000040  //!< RX Endpoint 6 Interrupt Enable
#define USB_USBRXIE_EP5            0x00000020  //!< RX Endpoint 5 Interrupt Enable
#define USB_USBRXIE_EP4            0x00000010  //!< RX Endpoint 4 Interrupt Enable
#define USB_USBRXIE_EP3            0x00000008  //!< RX Endpoint 3 Interrupt Enable
#define USB_USBRXIE_EP2            0x00000004  //!< RX Endpoint 2 Interrupt Enable
#define USB_USBRXIE_EP1            0x00000002  //!< RX Endpoint 1 Interrupt Enable
#define USB_USBRXIE_ALL            0x0000FFFE  //!< RX Endpoint 1 Interrupt Enable

//-- USB off 0x00A USBIS:			General Interrupt Status
#define USB_USBIS_VBUSERR          0x00000080  //!< VBus Error (host mode)
#define USB_USBIS_SESREQ           0x00000040  //!< Session Request (host mode)
#define USB_USBIS_DISCON           0x00000020  //!< Session Disconnect
#define USB_USBIS_CONN             0x00000010  //!< Session Connect (host mode)
#define USB_USBIS_SOF              0x00000008  //!< Start of Frame
#define USB_USBIS_BABBLE           0x00000004  //!< Babble Detected
#define USB_USBIS_RESET            0x00000004  //!< Reset Signal Detected
#define USB_USBIS_RESUME           0x00000002  //!< Resume Signal Detected
#define USB_USBIS_SUSPEND          0x00000001  //!< Suspend Signal Detected (device mode)

