miro-kostadinov/tmos/tmos/hardware/lm3s/usb_lm3s.h
//-- USB off 0x00B USBIE:			Interrupt Enable
#define USB_USBIE_VBUSERR          0x00000080  //!< Enable VBUS Error Interrupt (host mode)
#define USB_USBIE_SESREQ           0x00000040  //!< Enable Session Request Interrupt (host mode)
#define USB_USBIE_DISCON           0x00000020  //!< Enable Disconnect Interrupt
#define USB_USBIE_CONN             0x00000010  //!< Enable Connect Interrupt (host mode)
#define USB_USBIE_SOF              0x00000008  //!< Enable Start-of-Frame Interrupt
#define USB_USBIE_BABBLE           0x00000004  //!< Enable Babble Interrupt
#define USB_USBIE_RESET            0x00000004  //!< Enable Reset Interrupt
#define USB_USBIE_RESUME           0x00000002  //!< Enable Resume Interrupt
#define USB_USBIE_SUSPND           0x00000001  //!< Enable Suspend Interrupt (device mode

//-- USB off 0x00C USBFRAME:		Frame Value
#define USB_USBFRAME_Msk           0x000007FF  //!< Frame Number

//-- USB off 0x00E USBEPIDX:		Endpoint Index
#define USB_USBEPIDX_EPIDX_Msk     0x0000000F  //!< Endpoint Index

//-- USB off 0x00F USBTEST:			Test Mode
#define USB_USBTEST_FORCEH         0x00000080  //!< Force Host Mode (host mode)
#define USB_USBTEST_FIFOACC        0x00000040  //!< FIFO Access
#define USB_USBTEST_FORCEFS        0x00000020  //!< Force Full Speed

//-- USB off 0x020 USBFIFO[16]:		FIFO Endpoint 0-15
#define USB_USBFIFO_EPDATA_Msk      0xFFFFFFFF  //!< Endpoint Data

//-- USB off 0x060 USBDEVCTL:		Device Control
#define USB_USBDEVCTL_DEV          0x00000080  //!< Device Mode
#define USB_USBDEVCTL_FSDEV        0x00000040  //!< Full-Speed Device Detected
#define USB_USBDEVCTL_LSDEV        0x00000020  //!< Low-Speed Device Detected
#define USB_USBDEVCTL_VBUS_Msk     0x00000018  //!< VBus Level
#define USB_USBDEVCTL_VBUS_NONE    0x00000000  //!< Below SessionEnd
#define USB_USBDEVCTL_VBUS_SEND    0x00000008  //!< Above SessionEnd, below AValid
#define USB_USBDEVCTL_VBUS_AVALID  0x00000010  //!< Above AValid, below VBusValid
#define USB_USBDEVCTL_VBUS_VALID   0x00000018  //!< Above VBusValid
#define USB_USBDEVCTL_HOST         0x00000004  //!< Host Mode
#define USB_USBDEVCTL_HOSTREQ      0x00000002  //!< Host Request
#define USB_USBDEVCTL_SESSION      0x00000001  //!< Session Start/End

//-- USB off 0x062 USBTXFIFOSZ:		Transmit Dynamic FIFO Sizing
#define USB_USBTXFIFOSZ_DPB        0x00000010  //!< Double Packet Buffer Support
#define USB_USBTXFIFOSZ_SIZE_Msk   0x0000000F  //!< Max Packet Size
#define USB_USBTXFIFOSZ_SIZE_8     0x00000000  //!< 8
#define USB_USBTXFIFOSZ_SIZE_16    0x00000001  //!< 16
#define USB_USBTXFIFOSZ_SIZE_32    0x00000002  //!< 32
#define USB_USBTXFIFOSZ_SIZE_64    0x00000003  //!< 64
#define USB_USBTXFIFOSZ_SIZE_128   0x00000004  //!< 128
#define USB_USBTXFIFOSZ_SIZE_256   0x00000005  //!< 256
#define USB_USBTXFIFOSZ_SIZE_512   0x00000006  //!< 512
#define USB_USBTXFIFOSZ_SIZE_1024  0x00000007  //!< 1024
#define USB_USBTXFIFOSZ_SIZE_2048  0x00000008  //!< 2048

//-- USB off 0x063 USBRXFIFOSZ:		Receive Dynamic FIFO Sizing
#define USB_USBRXFIFOSZ_DPB        0x00000010  //!< Double Packet Buffer Support
#define USB_USBRXFIFOSZ_SIZE_Msk   0x0000000F  //!< Max Packet Size
#define USB_USBRXFIFOSZ_SIZE_8     0x00000000  //!< 8
#define USB_USBRXFIFOSZ_SIZE_16    0x00000001  //!< 16
#define USB_USBRXFIFOSZ_SIZE_32    0x00000002  //!< 32
#define USB_USBRXFIFOSZ_SIZE_64    0x00000003  //!< 64
#define USB_USBRXFIFOSZ_SIZE_128   0x00000004  //!< 128
#define USB_USBRXFIFOSZ_SIZE_256   0x00000005  //!< 256
#define USB_USBRXFIFOSZ_SIZE_512   0x00000006  //!< 512
#define USB_USBRXFIFOSZ_SIZE_1024  0x00000007  //!< 1024
#define USB_USBRXFIFOSZ_SIZE_2048  0x00000008  //!< 2048

//-- USB off 0x064 USBTXFIFOADD: 	Transmit FIFO Start Address
#define USB_USBTXFIFOADD_ADDR_Msk  0x00001FFF  //!< Transmit Start Address
#define USB_USBTXFIFOADD_ADDR_0    0x00000000  //!< 0
#define USB_USBTXFIFOADD_ADDR_8    0x00000001  //!< 8
#define USB_USBTXFIFOADD_ADDR_16   0x00000002  //!< 16
#define USB_USBTXFIFOADD_ADDR_32   0x00000003  //!< 32
#define USB_USBTXFIFOADD_ADDR_64   0x00000004  //!< 64
#define USB_USBTXFIFOADD_ADDR_128  0x00000005  //!< 128
#define USB_USBTXFIFOADD_ADDR_256  0x00000006  //!< 256
#define USB_USBTXFIFOADD_ADDR_512  0x00000007  //!< 512
#define USB_USBTXFIFOADD_ADDR_1024 0x00000008  //!< 1024
#define USB_USBTXFIFOADD_ADDR_2048 0x00000009  //!< 2048

//-- USB off 0x066 USBRXFIFOADD: 	Receive FIFO Start Address
#define USB_USBRXFIFOADD_ADDR_Msk  0x00001FFF  //!< Receive Start Address
#define USB_USBRXFIFOADD_ADDR_0    0x00000000  //!< 0
#define USB_USBRXFIFOADD_ADDR_8    0x00000001  //!< 8
#define USB_USBRXFIFOADD_ADDR_16   0x00000002  //!< 16
#define USB_USBRXFIFOADD_ADDR_32   0x00000003  //!< 32
#define USB_USBRXFIFOADD_ADDR_64   0x00000004  //!< 64
#define USB_USBRXFIFOADD_ADDR_128  0x00000005  //!< 128
#define USB_USBRXFIFOADD_ADDR_256  0x00000006  //!< 256
#define USB_USBRXFIFOADD_ADDR_512  0x00000007  //!< 512
#define USB_USBRXFIFOADD_ADDR_1024 0x00000008  //!< 1024
#define USB_USBRXFIFOADD_ADDR_2048 0x00000009  //!< 2048

//-- USB off 0x07A USBCONTIM:		Connect Timing
#define USB_USBCONTIM_WTCON_Msk    0x000000F0  //!< Connect Wait
#define USB_USBCONTIM_WTID_Msk     0x0000000F  //!< Wait ID

//-- USB off 0x07B USBVPLEN:		OTG VBus Pulse Timing
#define USB_USBVPLEN_VPLEN_Msk     0x000000FF  //!< VBus Pulse Length

//-- USB off 0x07D USBFSEOF:		Full-Speed Last Transaction to End of Frame Timing
#define USB_USBFSEOF_FSEOFG_Msk    0x000000FF  //!< Full-Speed End-of-Frame Gap

//-- USB off 0x07E USBLSEOF:		Low-Speed Last Transaction to End of Frame Timing
#define USB_USBLSEOF_LSEOFG_Msk    0x000000FF  //!< Low-Speed End-of-Frame Gap


//-- USB 0ff 0x080 (+ 0x0) USBTXFUNCADDR: Transmit Functional Address Endpoint 0-15
#define USB_USBTXFUNCADDR_ADDR_Msk 0x0000007F  //!< Device Address

//-- USB 0ff 0x080 (+ 0x2) USBTXHUBADDR:  Transmit Hub Address Endpoint 0-15
#define USB_USBTXHUBADDR_MULTTRAN  0x00000080  //!< Multiple Translators
#define USB_USBTXHUBADDR_ADDR_Msk  0x0000007F  //!< Hub Address

//-- USB 0ff 0x080 (+ 0x3) USBTXHUBPORT:  Transmit Hub Port Endpoint 0-15
#define USB_USBTXHUBPORT_PORT_Msk  0x0000007F  //!< Hub Port

//-- USB 0ff 0x080 (+ 0x4) USBRXFUNCADDR: Receive Functional Address Endpoint 1-15
#define USB_USBRXFUNCADDR_ADDR_Msk 0x0000007F  //!< Device Address

//-- USB 0ff 0x080 (+ 0x6) USBRXHUBADDR:  Receive Hub Address Endpoint 1-15
#define USB_USBRXHUBADDR_MULTTRAN  0x00000080  //!< Multiple Translators
#define USB_USBRXHUBADDR_ADDR_Msk  0x0000007F  //!< Hub Address

//-- USB 0ff 0x080 (+ 0x7) USBRXHUBPORT:  Receive Hub Port Endpoint 1-15
#define USB_USBRXHUBPORT_PORT_Msk  0x0000007F  //!< Hub Port



//-- USB 0ff 0x100 (+ 0x0)	USBTXMAXP:  	 Maximum Transmit Data Endpoint 1-15
#define USB_USBTXMAXP_MAXLOAD_Msk  0x000007FF  //!< Maximum Payload

//-- USB 0ff 0x100 (+ 0x2)	USBTXCSRL:	   	 Transmit Control and Status Endpoint 0-15 Low
/** NAK Timeout
 * host mode ep 0:
 * 		0	No timeout.
 *		1 	Indicates that endpoint 0 is halted following the receipt of NAK
 *		 	responses for longer than the time set by the USBNAKLMT register.
 * host mode bulk endpoints:
 * 		0	No timeout.
 * 		1	Indicates that the transmit endpoint is halted following the receipt
 * 			of NAK responses for longer than the time set by the NAKLMT field in
 * 			the USBTXINTERVALn register.
 * 			Software must clear this bit to allow the endpoint to continue
 */
#define USB_USBTXCSRL_NAKTO        0x00000080

