miro-kostadinov/tmos/tmos/hardware/lm3s/usb_lm3s.h
/** Setup End Clear
 * device mode ep 0:
 * 		Writing a 1 to this bit clears the SETEND bit.
 */
#define USB_USBTXCSRL_SETENDC      0x00000080



/** Status Packet
 * host mode ep 0:
 * 		0 	No transaction.
 * 		1	Initiates a STATUS stage transaction. This bit must be set at the
 * 			same time as the TXRDY or REQPKT bit is set.
 */
#define USB_USBTXCSRL0_STATUS      0x00000040

/** RXRDY Clear
 * device mode ep 0:
 *		Writing a 1 to this bit clears the RXRDY bit.
 */
#define USB_USBTXCSRL0_RXRDYC      0x00000040

/** Clear Data Toggle
 * ep 1-15:
 * 		Writing a 1 to this bit clears the DT bit in the USBTXCSRHn register
 */
#define USB_USBTXCSRL_CLRDT        0x00000040



/** Request Packet
 * host mode ep 0:
 * 		0 	No request
 * 		1 	Requests an IN transaction
 */
#define USB_USBTXCSRL0_REQPKT      0x00000020

/** Send Stall
 * device mode ep 0:
 *		0 	No effect
 *		1	Terminates the current transaction and transmits the STALL handshake
 */
#define USB_USBTXCSRL0_STALL       0x00000020

/** Endpoint Stalled
 * host mode ep 1-15:
 * 		0 	A STALL handshake has not been received.
 * 		1	Indicates that a STALL handshake has been received. When this bit is
 * 			set, any μDMA request that is in progress is stopped, the FIFO is
 * 			completely flushed, and the TXRDY bit is cleared.
 * 		Software must clear this bit.
 * device mode ep 1-15:
 * 		0 	A STALL handshake has not been transmitted.
 * 		1	A STALL handshake has been transmitted. The FIFO is flushed and the
 * 			TXRDY bit is cleared.
 * 		Software must clear this bit.
 */
#define USB_USBTXCSRL_STALLED      0x00000020



/** Error
 * host mode ep 0:
 * 		0 	No error.
 * 		1	Three attempts have been made to perform a transaction with no
 * 			response from the peripheral. The EP0 bit in the USBTXIS register is
 * 			 also set in this situation.
 */
#define USB_USBTXCSRL0_ERROR       0x00000010

/** Setup End
 * device mode ep 0 (RO):
 *		0	A control transaction has not ended or ended after the DATAEND bit
 *			was set.
 *		1	A control transaction has ended before the DATAEND bit has been set.
 *			The EP0 bit in the USBTXIS register is also set in this situation.
 */
#define USB_USBTXCSRL0_SETEND      0x00000010

/** Setup Packet
 * host mode ep 1-15:
 *		0 	No SETUP token is sent.
 *		1	Sends a SETUP token instead of an OUT token for the transaction.
 *			This bit should be set at the same time as the TXRDY bit is set.
 *	Note: Setting this bit also clears the DT bit in the USBTXCSRHn register.
 */
#define USB_USBTXCSRL_SETUP        0x00000010

/** Send Stall
 * device mode ep 1-15:
 * 		0 	No effect.
 * 		1 	Issues a STALL handshake to an IN token.
 * 		Software clears this bit to terminate the STALL condition.
 * 		Note: This bit has no effect in isochronous transfers.
 */
#define USB_USBTXCSRL_STALL        0x00000010



/** Setup Packet
 * host mode ep 0
 *		0	Sends an OUT token
 *		1 	Sends a SETUP token instead of an OUT token for the transaction.
 *			This bit should be set at the same time as the TXRDY bit is set.
 */
#define USB_USBTXCSRL0_SETUP       0x00000008

/** Data End
 * device mode ep 0
 *		0 	No effect
 *		1	Set this bit in the following situations:
 *			■ When setting TXRDY for the last data packet
 *			■ When clearing RXRDY after unloading the last data packet
 *			■ When setting TXRDY for a zero-length data packet
 */
#define USB_USBTXCSRL0_DATAEND     0x00000008

/** Flush FIFO
 * ep 1-15:
 * 		0	No effect.
 * 		1	Flushes the latest packet from the endpoint transmit FIFO. The FIFO
 * 			pointer is reset and the TXRDY bit is cleared. The EPn bit in the
 * 			USBTXIS register is also set in this situation.
 * 		This bit may be set simultaneously with the TXRDY bit to abort the
 * 		packet that is currently being loaded into the FIFO. Note that if the
 * 		FIFO is double-buffered, FLUSH may have to be set twice to completely
 * 		clear the FIFO.
 * 		Important: This bit should only be set when the TXRDY bit is set. At
 * 		other times, it may cause data to be corrupted.
 */
#define USB_USBTXCSRL_FLUSH        0x00000008



/** Endpoint Stalled
 * host mode ep 0:
 * 		0 	No handshake has been received.
 * 		1 	A STALL handshake has been received.
 * device mode ep 0:
 * 		0 	A STALL handshake has not been transmitted
 * 		1 	A STALL handshake has been transmitted.
 */
#define USB_USBTXCSRL0_STALLED     0x00000004

/** Error
 * host mode ep 1-15:
 * 		0	No error
 * 		1	Three attempts have been made to send a packet and no handshake
 * 			packet has been received. The TXRDY bit is cleared, the EPn bit in
 * 			the USBTXIS register is set, and the FIFO is completely flushed in
 * 			this situation.
 * 		Software must clear this bit.
 * 		Note: This is valid only when the endpoint is operating in Bulk or
 * 		Interrupt mode
 */
#define USB_USBTXCSRL_ERROR        0x00000004

/** Underrun
 * device mode ep 1-15:
 *		0 	No underrun
 *		1 	An IN token has been received when TXRDY is not set.
 *		Software must clear this bit.
 */
#define USB_USBTXCSRL_UNDRN        0x00000004



/** Transmit Packet Ready
 * host mode ep 0:
 * 		0 	No transmit packet is ready.
 * 		1	Software sets this bit after loading a data packet into the TX FIFO.
 * 			The EP0 bit in the USBTXIS register is also set in this situation.
 * 			If both the TXRDY and SETUP bits are set, a setup packet is sent.
 * 			If just TXRDY is set, an OUT packet is sent.
 * device mode ep 0:
 * 		0 	No transmit packet is ready.
 * 		1	Software sets this bit after loading an IN data packet into the
 * 			TX FIFO. The EP0 bit in the USBTXIS register is also set in this
 * 			situation.
 */
#define USB_USBTXCSRL0_TXRDY       0x00000002

/** FIFO Not Empty
 * ep 1-15:
 * 		0 	The FIFO is empty
 * 		1	At least one packet is in the transmit FIFO
 */
#define USB_USBTXCSRL_FIFONE       0x00000002



/** Receive Packet Ready
 * host mode ep 0:
 * 		0 	No received packet has been received.
 * 		1	Indicates that a data packet has been received in the RX FIFO.
 * 			The EP0 bit in the USBTXIS register is also set in this situation.
 */
#define USB_USBTXCSRL0_RXRDY       0x00000001

/** Transmit Packet Ready
 * ep 1-15:
 *		0 	No transmit packet is ready.
 *		1	Software sets this bit after loading a data packet into the TX FIFO.
 */
#define USB_USBTXCSRL_TXRDY        0x00000001



//-- USB 0ff 0x100 (+ 0x3)	USBTXCSRH:    	 Transmit Control and Status Endpoint 0-15 High
#define USB_USBTXCSRH0_DTWE        0x00000004  //!< Data Toggle Write Enable (host)
#define USB_USBTXCSRH0_DT          0x00000002  //!< Data Toggle (host)
#define USB_USBTXCSRH0_FLUSH       0x00000001  //!< Flush FIFO

#define USB_USBTXCSRH_AUTOSET      0x00000080  //!< Auto Set
#define USB_USBTXCSRH_ISO          0x00000040  //!< ISO	(device)
#define USB_USBTXCSRH_MODE         0x00000020  //!< Mode
#define USB_USBTXCSRH_DMAEN        0x00000010  //!< DMA Request Enable
#define USB_USBTXCSRH_FDT          0x00000008  //!< Force Data Toggle
#define USB_USBTXCSRH_DMAMOD       0x00000004  //!< DMA Request Mode
#define USB_USBTXCSRH_DTWE         0x00000002  //!< Data Toggle Write Enable (host)
#define USB_USBTXCSRH_DT           0x00000001  //!< Data Toggle (host)

//-- USB 0ff 0x100 (+ 0x4)	USBRXMAXP:		 Maximum Receive Data Endpoint 1-15
#define USB_USBRXMAXP_MAXLOAD_Msk  0x000007FF  //!< Maximum Payload

//-- USB 0ff 0x100 (+ 0x6)	USBRXCSRL:     	 Receive Control and Status Endpoint 1-15 Low
#define USB_USBRXCSRL_CLRDT        0x00000080  //!< Clear Data Toggle
#define USB_USBRXCSRL_STALLED      0x00000040  //!< Endpoint Stalled
#define USB_USBRXCSRL_STALL        0x00000020  //!< Send Stall (device)
#define USB_USBRXCSRL_REQPKT       0x00000020  //!< Request Packet (host)
#define USB_USBRXCSRL_FLUSH        0x00000010  //!< Flush FIFO
#define USB_USBRXCSRL_DATAERR      0x00000008  //!< Data Error (device)
#define USB_USBRXCSRL_NAKTO        0x00000008  //!< NAK Timeout (host)
#define USB_USBRXCSRL_OVER         0x00000004  //!< Overrun (device)
#define USB_USBRXCSRL_ERROR        0x00000004  //!< Error (host)
#define USB_USBRXCSRL_FULL         0x00000002  //!< FIFO Full
#define USB_USBRXCSRL_RXRDY        0x00000001  //!< Receive Packet Ready

//-- USB 0ff 0x100 (+ 0x7)	USBRXCSRH:		 Receive Control and Status Endpoint 1-15 High
#define USB_USBRXCSRH_AUTOCL       0x00000080  //!< Auto Clear
#define USB_USBRXCSRH_AUTORQ       0x00000040  //!< Auto Request (host)
#define USB_USBRXCSRH_ISO          0x00000040  //!< ISO (device)
#define USB_USBRXCSRH_DMAEN        0x00000020  //!< DMA Request Enable
#define USB_USBRXCSRH_DISNYET      0x00000010  //!< Disable NYET (device)
#define USB_USBRXCSRH_PIDERR       0x00000010  //!< PID Error (host)
#define USB_USBRXCSRH_DMAMOD       0x00000008  //!< DMA Request Mode
#define USB_USBRXCSRH_DTWE         0x00000004  //!< Data Toggle Write Enable (host)
#define USB_USBRXCSRH_DT           0x00000002  //!< Data Toggle (host)

//-- USB 0ff 0x100 (+ 0x8)	USBRXCOUNT:		 Receive Byte Count Endpoint 0-15
#define USB_USBRXCOUNT_COUNT_Msk   0x00001FFF  //!< Receive Packet Count
#define USB_USBRXCOUNT0_COUNT_Msk  0x0000007F  //!< Count

