miro-kostadinov/tmos/tmos/hardware/lm3s/usb_lm3s.h
//-- USB 0ff 0x100 (+ 0xA)	USBTXTYPE:		 Host Transmit Configure Type Endpoint 0-15
#define USB_USBTXTYPE_SPEED_Msk    0x000000C0  //!< Operating Speed
#define USB_USBTXTYPE_SPEED_DFLT   0x00000000  //!< Default
#define USB_USBTXTYPE_SPEED_FULL   0x00000080  //!< Full
#define USB_USBTXTYPE_SPEED_LOW    0x000000C0  //!< Low
#define USB_USBTXTYPE_PROTO_Msk    0x00000030  //!< Protocol
#define USB_USBTXTYPE_PROTO_CTRL   0x00000000  //!< Control
#define USB_USBTXTYPE_PROTO_ISOC   0x00000010  //!< Isochronous
#define USB_USBTXTYPE_PROTO_BULK   0x00000020  //!< Bulk
#define USB_USBTXTYPE_PROTO_INT    0x00000030  //!< Interrupt
#define USB_USBTXTYPE_TEP_Msk      0x0000000F  //!< Target Endpoint Number


//-- USB 0ff 0x100 (+ 0xB)	USBTXINTERVAL:	 Host Transmit Interval Endpoint 0-15
#define USB_USBTXINTERVAL_NAKLMT_Msk  	  0x000000FF  //!< NAK Limit is 2(m-1) frames (bulk transfers)
#define USB_USBTXINTERVAL_TXPOLL_INT_Msk  0x000000FF  //!< TX polling interval is m frames. (interrupt transfers)
#define USB_USBTXINTERVAL_TXPOLL_ISO_Msk  0x0000001F  //!< TX polling interval is 2^(m-1) frames. (isochronious transfers)

//-- USB 0ff 0x100 (+ 0xC)	USBRXTYPE:		 Host Configure Receive Type Endpoint 1-15
#define USB_USBRXTYPE_SPEED_Msk    0x000000C0  //!< Operating Speed
#define USB_USBRXTYPE_SPEED_DFLT   0x00000000  //!< Default
#define USB_USBRXTYPE_SPEED_FULL   0x00000080  //!< Full
#define USB_USBRXTYPE_SPEED_LOW    0x000000C0  //!< Low
#define USB_USBRXTYPE_PROTO_Msk    0x00000030  //!< Protocol
#define USB_USBRXTYPE_PROTO_CTRL   0x00000000  //!< Control
#define USB_USBRXTYPE_PROTO_ISOC   0x00000010  //!< Isochronous
#define USB_USBRXTYPE_PROTO_BULK   0x00000020  //!< Bulk
#define USB_USBRXTYPE_PROTO_INT    0x00000030  //!< Interrupt
#define USB_USBRXTYPE_TEP_Msk      0x0000000F  //!< Target Endpoint Number

//-- USB 0ff 0x100 (+ 0xD)	USBRXINTERVAL:	 Host Receive Polling Interval Endpoint 1-15
#define USB_USBRXINTERVAL_TXPOLL_Msk 0x000000FF  //!< RX Polling
#define USB_USBRXINTERVAL_NAKLMT_Msk 0x000000FF  //!< NAK Limit



//-- USB 0ff 0x300 (+ 0x0) USBRQPKTCOUNT:		Request Packet Count in Block Transfer Endpoint 1-15
#define USB_USBRQPKTCOUNT_COUNT_Msk  0x0000FFFF  //!< Block Transfer Packet Count

//-- USB off 0x340 USBRXDPKTBUFDIS: Receive Double Packet Buffer Disable
#define USB_USBRXDPKTBUFDIS_EP15   0x00008000  //!< EP15 RX Double-Packet Buffer Disable
#define USB_USBRXDPKTBUFDIS_EP14   0x00004000  //!< EP14 RX Double-Packet Buffer Disable
#define USB_USBRXDPKTBUFDIS_EP13   0x00002000  //!< EP13 RX Double-Packet Buffer Disable
#define USB_USBRXDPKTBUFDIS_EP12   0x00001000  //!< EP12 RX Double-Packet Buffer Disable
#define USB_USBRXDPKTBUFDIS_EP11   0x00000800  //!< EP11 RX Double-Packet Buffer Disable
#define USB_USBRXDPKTBUFDIS_EP10   0x00000400  //!< EP10 RX Double-Packet Buffer Disable
#define USB_USBRXDPKTBUFDIS_EP9    0x00000200  //!< EP9 RX Double-Packet Buffer Disable
#define USB_USBRXDPKTBUFDIS_EP8    0x00000100  //!< EP8 RX Double-Packet Buffer Disable
#define USB_USBRXDPKTBUFDIS_EP7    0x00000080  //!< EP7 RX Double-Packet Buffer Disable
#define USB_USBRXDPKTBUFDIS_EP6    0x00000040  //!< EP6 RX Double-Packet Buffer Disable
#define USB_USBRXDPKTBUFDIS_EP5    0x00000020  //!< EP5 RX Double-Packet Buffer Disable
#define USB_USBRXDPKTBUFDIS_EP4    0x00000010  //!< EP4 RX Double-Packet Buffer Disable
#define USB_USBRXDPKTBUFDIS_EP3    0x00000008  //!< EP3 RX Double-Packet Buffer Disable
#define USB_USBRXDPKTBUFDIS_EP2    0x00000004  //!< EP2 RX Double-Packet Buffer Disable
#define USB_USBRXDPKTBUFDIS_EP1    0x00000002  //!< EP1 RX Double-Packet Buffer Disable

//-- USB off 0x342 USBTXDPKTBUFDIS: Transmit Double Packet Buffer Disable
#define USB_USBTXDPKTBUFDIS_EP15   0x00008000  //!< EP15 TX Double-Packet Buffer Disable
#define USB_USBTXDPKTBUFDIS_EP14   0x00004000  //!< EP14 TX Double-Packet Buffer Disable
#define USB_USBTXDPKTBUFDIS_EP13   0x00002000  //!< EP13 TX Double-Packet Buffer Disable
#define USB_USBTXDPKTBUFDIS_EP12   0x00001000  //!< EP12 TX Double-Packet Buffer Disable
#define USB_USBTXDPKTBUFDIS_EP11   0x00000800  //!< EP11 TX Double-Packet Buffer Disable
#define USB_USBTXDPKTBUFDIS_EP10   0x00000400  //!< EP10 TX Double-Packet Buffer Disable
#define USB_USBTXDPKTBUFDIS_EP9    0x00000200  //!< EP9 TX Double-Packet Buffer Disable
#define USB_USBTXDPKTBUFDIS_EP8    0x00000100  //!< EP8 TX Double-Packet Buffer Disable
#define USB_USBTXDPKTBUFDIS_EP7    0x00000080  //!< EP7 TX Double-Packet Buffer Disable
#define USB_USBTXDPKTBUFDIS_EP6    0x00000040  //!< EP6 TX Double-Packet Buffer Disable
#define USB_USBTXDPKTBUFDIS_EP5    0x00000020  //!< EP5 TX Double-Packet Buffer Disable
#define USB_USBTXDPKTBUFDIS_EP4    0x00000010  //!< EP4 TX Double-Packet Buffer Disable
#define USB_USBTXDPKTBUFDIS_EP3    0x00000008  //!< EP3 TX Double-Packet Buffer Disable
#define USB_USBTXDPKTBUFDIS_EP2    0x00000004  //!< EP2 TX Double-Packet Buffer Disable
#define USB_USBTXDPKTBUFDIS_EP1    0x00000002  //!< EP1 TX Double-Packet Buffer Disable

//-- USB off 0x400 USBEPC:			External Power Control
#define USB_USBEPC_PFLTACT_Msk     0x00000300  //!< Power Fault Action
#define USB_USBEPC_PFLTACT_UNCHG   0x00000000  //!< Unchanged
#define USB_USBEPC_PFLTACT_TRIS    0x00000100  //!< Tristate
#define USB_USBEPC_PFLTACT_LOW     0x00000200  //!< Low
#define USB_USBEPC_PFLTACT_HIGH    0x00000300  //!< High
#define USB_USBEPC_PFLTAEN         0x00000040  //!< Power Fault Action Enable
#define USB_USBEPC_PFLTSEN_HIGH    0x00000020  //!< Power Fault Sense
#define USB_USBEPC_PFLTEN          0x00000010  //!< Power Fault Input Enable
#define USB_USBEPC_EPENDE          0x00000004  //!< EPEN Drive Enable
#define USB_USBEPC_EPEN_Msk        0x00000003  //!< External Power Supply Enable Configuration
#define USB_USBEPC_EPEN_LOW        0x00000000  //!< Power Enable Active Low
#define USB_USBEPC_EPEN_HIGH       0x00000001  //!< Power Enable Active High
#define USB_USBEPC_EPEN_VBLOW      0x00000002  //!< Power Enable High if VBUS Low
#define USB_USBEPC_EPEN_VBHIGH     0x00000003  //!< Power Enable High if VBUS High

//-- USB off 0x404 USBEPCRIS:		External Power Control Raw Interrupt Status
#define USB_USBEPCRIS_PF           0x00000001  //!< USB Power Fault Interrupt Status

//-- USB off 0x408 USBEPCIM:		External Power Control Interrupt Mask
#define USB_USBEPCIM_PF            0x00000001  //!< USB Power Fault Interrupt Mask

//-- USB off 0x40C USBEPCISC: 		External Power Control Interrupt Status and Clear
#define USB_USBEPCISC_PF           0x00000001  //!< USB Power Fault Interrupt Status and Clear

//-- USB off 0x410 USBDRRIS: 		Device RESUME Raw Interrupt Status
#define USB_USBDRRIS_RESUME        0x00000001  //!< Resume Interrupt Status

//-- USB off 0x414 USBDRIM: 		Device RESUME Interrupt Mask
#define USB_USBDRIM_RESUME         0x00000001  //!< Resume Interrupt Mask

//-- USB off 0x418 USBDRISC: 		Device RESUME Interrupt Status and Clear
#define USB_USBDRISC_RESUME        0x00000001  //!< Resume Interrupt Status and Clear

//-- USB off 0x41C USBGPCS: 		General-Purpose Control and Status
#define USB_USBGPCS_DEVMOD         0x00000001  //!< Device Mode
#define USB_USBGPCS_DEVMODOTG      0x00000002  //!< Enable Device Mode

