miro-kostadinov/tmos/tmos/hardware/lm3s/usb_lm3s.h
//-- USB off 0x430 USBVDC: 			VBUS Droop Control
#define USB_USBVDC_VBDEN           0x00000001  //!< VBUS Droop Enable

//-- USB off 0x434 USBVDCRIS: 		VBUS Droop Control Raw Interrupt Status
#define USB_USBVDCRIS_VD           0x00000001  //!< VBUS Droop Raw Interrupt Status

//-- USB off 0x438 USBVDCIM: 		VBUS Droop Control Interrupt Mask
#define USB_USBVDCIM_VD            0x00000001  //!< VBUS Droop Interrupt Mask

//-- USB off 0x43C USBVDCISC: 		VBUS Droop Control Interrupt Status and Clear
#define USB_USBVDCISC_VD           0x00000001  //!< VBUS Droop Interrupt Status and Clear

//-- USB off 0x444 USBIDVRIS: 		ID Valid Detect Raw Interrupt Status
#define USB_USBIDVRIS_ID           0x00000001  //!< ID Valid Detect Raw Interrupt Status

//-- USB off 0x448 USBIDVIM: 		ID Valid Detect Interrupt Mask
#define USB_USBIDVIM_ID            0x00000001  //!< ID Valid Detect Interrupt Mask

//-- USB off 0x44C USBIDVISC: 		ID Valid Detect Interrupt Status and Clear
#define USB_USBIDVISC_ID           0x00000001  //!< ID Valid Detect Interrupt Status and Clear

//-- USB off 0x450 USBDMASEL: 		DMA Select
#define USB_USBDMASEL_DMACTX_Msk   0x00F00000  //!< DMA C TX Select
#define USB_USBDMASEL_DMACRX_Msk   0x000F0000  //!< DMA C RX Select
#define USB_USBDMASEL_DMABTX_Msk   0x0000F000  //!< DMA B TX Select
#define USB_USBDMASEL_DMABRX_Msk   0x00000F00  //!< DMA B RX Select
#define USB_USBDMASEL_DMAATX_Msk   0x000000F0  //!< DMA A TX Select
#define USB_USBDMASEL_DMAARX_Msk   0x0000000F  //!< DMA A RX Select
#define USB_USBDMASEL_DMABTX_Pos   12		   //!< doc!
#define USB_USBDMASEL_DMABRX_Pos   8		   //!< doc!
#define USB_USBDMASEL_DMAATX_Pos   4		   //!< doc!
#define USB_USBDMASEL_DMAARX_Pos   0		   //!< doc!

#define USB0         ((USB_Type *)USB0_BASE)	//!< doc!


#endif /* USB_LM3S_H_ */
